#+STARTUP: overview
#+HTML_HEAD: <style type="text/css">body{ max-width:50%; }</style>
#+OPTIONS: \n:t
* ChIP protocol
Reagents needed
| Buffer   | Volume/sample (mL) | # samples | total volume (mL) |
|----------+--------------------+-----------+-------------------|
| Glycine  |                  1 |       4.5 |               4.5 |
| 1x PBS   |                 25 |           |             112.5 |
| lysis    |                0.5 |           |              2.25 |
| Dilution |                3.8 |           |              17.1 |
#+TBLFM: @2$4=$2*@2$3::@3$4=$2*@2$3::@4$4=$2*@2$3::@5$4=$2*@2$3
*** hypotonic buffer
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            10 |              1 |             50 |
| NaCl             |            10 |              1 |             50 |
| MgCl2            |           2.5 |              1 |           12.5 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |             5 |            H2O |         4.8875 |
#+TBLFM: @2$4=(@5$2*@2$2)/(@2$3)::@3$4=(@5$2*@3$2)/(@3$3)::@4$4=(@5$2*@4$2)/(@4$3)::@5$4=@5$2-vsum(@2..@4)/1000
*** RIP buffer
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            50 |              1 |            250 |
| NaCl             |           150 |              1 |            750 |
| MgCl2            |             1 |              1 |              5 |
| IGEPAL CA-630    |          0.5% |           100% |           250. |
| EDTA             |             5 |            0.5 |            50. |
| DTT              |             1 |              1 |              5 |
| RNaseOUT (u/mL)  |           200 |          40000 |             25 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |             5 |            H2O |          3.665 |
#+TBLFM: @2$4=(@9$2*@2$2)/(@2$3)::@3$4=(@9$2*@3$2)/(@3$3)::@4$4=(@9$2*@4$2)/(@4$3)::@5$4=(@9$2*10000*@5$2)/(@5$3)::@6$4=(@9$2*@6$2)/(@6$3)::@7$4=(@9$2*@7$2)/(@7$3)::@8$4=(@9$2*1000*@8$2)/(@8$3)::@9$4=@9$2-vsum(@2..@8)/1000
*** NT2 buffer (make fresh each day)
| Component        | TargConc (mM) | Stock Conc (M) | Stock Vol (uL) |
|------------------+---------------+----------------+----------------|
| Tris-HCl (pH7.5) |            50 |              1 |            250 |
| NaCl             |           150 |              1 |            750 |
| MgCl2            |             1 |              1 |              5 |
| IGEPAL CA-630    |         0.05% |           100% |            2.5 |
|------------------+---------------+----------------+----------------|
| TargVol(mL)      |             5 |       H2O (mL) |         3.9925 |
#+TBLFM: @2$4=(@6$2*@2$2)/(@2$3)::@3$4=(@6$2*@3$2)/(@3$3)::@4$4=(@6$2*@4$2)/(@4$3)::@5$4=(@6$2*1000*@5$2)/(@5$3)::@6$4=@6$2-vsum(@2..@5)/1000
** Buffer preparations
   Note 1: all buffers should be sterile filtered and good for 2 weeks at
   4 degree protected from light
   1. EDTA buffer (30 mL per mouse)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           3.75 |
| KCl         |             5 |              2 |          0.375 |
| NaH2PO4     |           0.5 |            0.5 |           0.15 |
| HEPES       |            10 |              1 |            1.5 |
| EDTA        |             5 |            0.5 |            1.5 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         270.24 |
| BDM         |            10 |         101.11 |        151.665 |
| Taurine     |            10 |         125.15 |        187.725 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           150 |            H2O |          139.3 |
| Ph to 7.8   |        approx |        1N NaOH |           0.75 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200

   2. Perfusion buffer (90 mL per mouse, accounting for Col and STOP)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           3.75 |
| KCl         |             5 |              2 |          0.375 |
| NaH2PO4     |           0.5 |            0.5 |           0.15 |
| HEPES       |            10 |              1 |            1.5 |
| MgCl2       |             1 |              1 |           0.15 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         270.24 |
| BDM         |            10 |         101.11 |        151.665 |
| Taurine     |            10 |         125.15 |        187.725 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           150 |            H2O |          132.2 |
| Ph to 7.8   |        approx |        1N NaOH |           0.75 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200
   3. Collagenase buffer (60 mL per mouse) in perfusion buffer
      Prepare right before procedure, warm to 37 degree
| Component     | TargConc (mg/mL) | Weight (mg)    |
|---------------+------------------+----------------|
| Collagenase 2 |              0.5 |           125. |
| Collagenase 4 |              0.5 |           125. |
| Protease XIV  |             0.05 |           12.5 |
| Volume (mL)   |              250 |                |
#+TBLFM: @2$3=$2 * @5$2::@3$3=$2 * @5$2::@4$3=$2 * @5$2
   4. Stop buffer (10 mL per mouse)
| Component             | TargConc (%) | volumn |
|-----------------------+--------------+--------|
| FBS                   |            5 |      2 |
| perfusion Buffer (mL) |           40 |     38 |
#+TBLFM: @2$3=@2$2*@3$2/100::@3$3=@3$2 - @2$3
** Buffer preparations
   Note 1: all buffers should be sterile filtered and good for 2 weeks at
   4 degree protected from light
   1. EDTA buffer (20 mL per mouse)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           6.25 |
| KCl         |             5 |              2 |          0.625 |
| NaH2PO4     |           0.5 |            0.5 |           0.25 |
| HEPES       |            10 |              1 |            2.5 |
| EDTA        |             5 |            0.5 |            2.5 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |          450.4 |
| BDM         |            10 |         101.11 |        252.775 |
| Taurine     |            10 |         125.15 |        312.875 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           250 |            H2O |        241.975 |
| Ph to 7.8   |        approx |        1N NaOH |           1.25 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200

   2. Perfusion buffer (20 mL per mouse, accounting for Col and STOP)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           6.25 |
| KCl         |             5 |              2 |          0.625 |
| NaH2PO4     |           0.5 |            0.5 |           0.25 |
| HEPES       |            10 |              1 |            2.5 |
| MgCl2       |             1 |              1 |           0.25 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |          450.4 |
| BDM         |            10 |         101.11 |        252.775 |
| Taurine     |            10 |         125.15 |        312.875 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           250 |            H2O |        243.325 |
| Ph to 7.8   |        approx |        1N NaOH |           1.25 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200
   3. Collagenase buffer (10 mL per mouse) in perfusion buffer
      Prepare right before procedure, warm to 37 degree
| Component                | TargConc (mg/mL) | Weight (mg) |
|--------------------------+------------------+-------------|
| Collagenase 2            |              3.2 |        240. |
| Soybean Trysin Inhibitor |              0.2 |         15. |
| Elastase suspension (uL) |             0.75 |   2122.6415 |
| Volume (mL)              |               75 |             |
#+TBLFM: @2$3=$2 * @5$2::@3$3=$2 * @5$2::@4$3=(($2 * @5$2) / 26.5) * 1000
   4. Stop buffer (5 mL per mouse)
| Component             | TargConc (%) | volumn |
|-----------------------+--------------+--------|
| FBS                   |            5 |      1 |
| perfusion Buffer (mL) |           20 |     19 |
#+TBLFM: @2$3=@2$2*@3$2/100::@3$3=@3$2 - @2$3
** 293
   24 well plate
|    well |  6.5 |           |
|---------+------+-----------|
| Plasmid | DMEM | turbofect |
|---------+------+-----------|
|    1.07 |  100 |         2 |
|   6.955 | 650. |       13. |
#+TBLFM: @4$1=@1$2*@3$1::@4$2=@1$2*@3$2::@4$3=@1$2*@3$3
protein related analysis done 48 hours post, RNA related can be done 24 post
** Cos-7
10 cm dish
| plate         |                     1 |                |           |           |
|---------------+-----------------------+----------------+-----------+-----------|
| construct     | concentration (ng/uL) | Plasmid volume | DMEM (uL) | Turbofect |
|---------------+-----------------------+----------------+-----------+-----------|
| pCDNA3.1-ShhN |               1547.95 |      3.8760942 |       600 |        12 |
| linearized    |                 939.6 |      6.3856960 |       600 |        12 |
#+TBLFM: @3$3=6*1000/@3$2::@4$3=6*1000/@4$2
for linearizing, 6.5 uL of plasmid (10ug) + 5 uL of NEBuffer3.1 + 10 uL of BglII (NEB R0144S) + 28.5 H2O. Digest at 37c for 2 hours
Column purify after.
